[{"content":"Under Construction Please go to the Mentoring section\n","date":1670461270,"description":"","lastmod":"2022-12-07T18:01:10-07:00","objectID":"3976528693a0108357f4928017600865","permalink":"/","publishdate":"2022-12-07T18:01:10-07:00","title":"First"},{"content":"","date":1670461270,"description":"","lastmod":"2022-12-07T18:01:10-07:00","objectID":"0f64b20c75b5e6cb4f27fc7bf66b4c6c","permalink":"/sample/","publishdate":"2022-12-07T18:01:10-07:00","title":"Mentoring"},{"content":" \u0026amp;ldquo;If I have seen further than others, it is by standing on the shoulders of giants.\u0026amp;rdquo; - Sir Isaac Newton\nWhy do I want to be mentored? Eight years of professional experience and I\u0026amp;rsquo;ve had a handful of impactful mentors.The mentoring I\u0026amp;rsquo;ve taken part of has made me a better technical worker along with a more well rounded person. It\u0026amp;rsquo;s invaluable to see how a professional approaches a problem.\nHow do they pick apart a task? What balance is taken between thoughful planning vs. action? What technical best practices with nuanced knowledge are they applying at the lowest level? Take these smaller details and roll them up into a larger professional plan. This is where I need help.\nWhat things do I want help with? One word fits like a glove when describing the challenge I\u0026amp;rsquo;m up against. That word being: unfocused. The phrase, \u0026amp;ldquo;jack of all trades but a master of none\u0026amp;rdquo; comes to mind. My skillset has breadth that I am proud of but I fear is short sided.\nAnother battle I\u0026amp;rsquo;m fighting is finding the right job. The position in which I thrived the most had variety baked into it. I was a one man reporting team, responsible for all things Power BI and SSRS. This satisified my need for workspace ownership. Technically, I was a SQL Server DBA so I had administrative tasks as well as the permissions to peform the ETL related duties. I truly felt like a full stack Micrsoft Business Intelligence Developer.\nYou might be wondering why I\u0026amp;rsquo;d leave that position. The short of it is that I was offered significantly more money elsewhere. According to Brent Ozar\u0026amp;rsquo;s Salary Survey, my unicorn job\u0026amp;rsquo;s salary was awfully low. I\u0026amp;rsquo;ve since worked at larger more bureaucratic organizations. Here I fight with red tape to get things done and at times feel pigeon holed to a set of tasks. The upside to changing jobs is that I\u0026amp;rsquo;ve been more exposed to Microsft\u0026amp;rsquo;s cloud tools.\nMy goals as a mentee Identify a skillset to build upon …","date":1670461270,"description":"","lastmod":"2022-12-07T18:01:10-07:00","objectID":"40833a3e89fff4d0825f88ba5a8f4c3c","permalink":"/sample/markdown-syntax/","publishdate":"2022-12-07T18:01:10-07:00","title":"Why me?"}]